{
    "servers": {
        "797781758841847808": {
            "logss": {
                "response": "-> N'ouvrez PAS Ryujinx à nouveau, sinon le fichier journal sera recréé.\n-> Naviguez jusqu'au dossier « Logs » où se trouve Ryujinx.exe.\n-> Envoyez le dernier fichier de log, le fichier entier, pas seulement le contenu à l'intérieur.\n-> Si vous avez ouvert Ryujinx après un crash, partagez le log juste avant le dernier log.",
                "description": "Guide pour partager les logs de Ryujinx",
                "messages": 44,
                "last_message": 0
            },
            "ud": {
                "response": "Ce petit logiciel va réaliser un diagnostic de votre pc afin d'identifier ce qui ne va pas :\n1. Télécharger l'application : <https://userdiag.com/>\n2. Fermer le plus grand nombre d'applications ouvertes\n3. Lancer l'application puis le **__diagnostic rapide__**\n4. **Lorsque le test est terminé, __envoyer le lien dans ce salon__ (CTRL + V)**",
                "description": "Aide pour utiliser UserDiag et diagnostiquer votre PC",
                "messages": 44,
                "last_message": 0
            },
            "jd": {
                "response": "**JDownloader 2 : Qu'est-ce que c'est et comment l'utiliser ?**",
                "description": "Guide complet sur JDownloader 2 et son utilisation",
                "messages": 44,
                "last_message": 0
            },
            "cpp": {
                "response": "<https://www.techpowerup.com/download/visual-c-redistributable-runtime-package-all-in-one/>",
                "description": "Installation des Visual C++ Redistributables",
                "messages": 44,
                "last_message": 0
            },
            "revo": {
                "response": "1. Installer la version gratuite portable de <https://www.revouninstaller.com/>\n2. Extraire et démarrer Revo Uninstaller, cibler le logiciel à désinstaller et cliquer sur \"désinstaller\"\n3. Décocher la case demandant de créer un point de restauration système\n4. Le désinstallateur par défaut se lance. Aller jusqu'au bout de la démarche, jusqu'à ce qu'il n'y ai plus de fenêtre en lien avec le désinstallateur et que la désinstallation soit finie.\n5. Cocher la case \"Advanced\" ou \"Avancé\" et cliquer sur suivant.\n6. Supprimer toutes les clés de registre restantes dans Revo (bouton \"Sélectionner tout\" puis bouton \"Supprimer\")\n7. Supprimer tous les fichiers restants dans Revo (bouton \"Sélectionner tout\" puis bouton \"Supprimer\")\n8. Fermer Revo\n9. Redémarrer son PC\n10. Chercher manuellement dans plusieurs dossiers s'il ne reste pas des fichiers de configuration et les supprimer :\n```C:/Users/[ton nom d'utilisateur]/AppData/Roaming\nC:/Users/[ton nom d'utilisateur]/AppData/Local\nC:/Users/Public/AppData/Roaming\nC:/Users/Public/AppData/Local\nC:/ProgramData\nC:/Program Files\nC:/Program Files (x86)```\n\n11. Supprimer Revo Uninstaller Portable",
                "description": "Comment (bien) désinstaller une application"
            },
            "wd": {
                "response": "### **Comment exclure un dossier dans Windows Defender**  \n\nMicrosoft Defender Antivirus (anciennement Windows Defender) fournit une protection en temps réel contre les menaces, mais il peut parfois bloquer des fichiers ou des dossiers légitimes. Pour éviter cela, vous pouvez **exclure un dossier spécifique** de l'analyse. Procédez comme suit :  \n\n### **1. Ouvrez les paramètres de Windows Defender**  \n1. **Cliquez sur le menu Démarrer** (icône Windows en bas à gauche de l'écran).  \n2. **Tapez « Sécurité Windows »** et ouvrez l'application correspondante.  \n3. Dans la nouvelle fenêtre, cliquez sur **Protection contre les virus et les menaces**.  \n\n### **2. Accédez aux paramètres d'exclusion**  \n4. Faites défiler vers le bas et cliquez sur **Gestion des paramètres** dans la section **Paramètres de protection contre les virus et les menaces**.  \n5. Faites défiler vers le bas pour trouver **Exclusions**, puis cliquez sur **Ajouter ou supprimer des exclusions**.  \n\n### **3. Ajouter un dossier aux exclusions**  \n6. Cliquez sur **Ajouter une exclusion**, puis sélectionnez **Dossier**.  \n7. Naviguez jusqu'au dossier que vous souhaitez exclure, sélectionnez-le et cliquez sur **OK**.  \n\nUne fois ajouté, Microsoft Defender n'analysera plus ce dossier, réduisant ainsi les risques de faux positifs tout en améliorant les performances pour les fichiers de confiance.\n\nVoici 2 vidéos pour démontrer cette configuration :\n<https://www.youtube.com/watch?v=BonLkFNnO9w>\n<https://www.youtube.com/watch?v=zGiNGnX5dYg>",
                "description": "Procédure pour exclure un dossier de Windows Defender"
            },
            "logsc": {
                "response": "1. **Ouvrir Azahar:** Lance Azahar sur ton ordinateur.\n\n2. **Accéder à l'option \"Fichier\" :** Une fois que Azahar est ouvert, clique sur l'onglet ou le menu intitulé \"Fichier\".\n\n3. **Choisir \"Ouvrir le dossier Citra\" :** Dans le menu déroulant de \"Fichier\", sélectionne l'option \"Ouvrir le dossier Azahar\". Cela te permettra d'accéder au répertoire où azahar stocke ses fichiers.\n\n4. **Localiser le dossier \"logs\" :** Une fois que le dossier Citra est ouvert, cherche un sous-dossier nommé \"logs\". Clique dessus pour voir les fichiers de logs.\n\nLes fichiers contenus dans le dossier \"logs\" sont ceux qui enregistrent les événements et erreurs que Citra rencontre. Tu peux les ouvrir avec un éditeur de texte (par exemple, Notepad++ ou tout autre éditeur de ton choix) pour les lire.\n\n5. **Envoyer les logs** : Maintenant, envoie les 2 fichiers logs (pas le play_time.bin) dans ce salon en les glissants dans le tchat.",
                "description": "Comment ouvrir les logs sur azahar"
            }
        },
        "1289627804211609640": {
            "wd": {
                "response": "Follow this : https://discord.com/channels/1289627804211609640/1309841345904381952/1361672966722818220\n\nDownload theses 2 files and put it with ur game AND RUN THE BAT FILE, THE RUN ME FIRST FILE\nMake sure you have ur game downloaded with you",
                "description": "How to exclude a folder in Windows Defender",
                "messages": 44,
                "last_message": 0
            },
            "dns": {
                "response": "## **Changing DNS System-Wide**  \n\nIf you want **all applications** (not just your browser) to use a specific DNS, you'll need to change the DNS settings at the operating system level:  \n- **Windows:** Go to `Control Panel > Network & Internet > Change adapter settings`, then modify DNS settings in your network properties.  \n- **Mac:** Open `System Preferences > Network > Advanced > DNS` and enter your preferred DNS servers.  \n- **Linux:** Modify the `/etc/resolv.conf` file or use **Network Manager** to change your DNS.  \n\n---\n\n### **Recommended Public DNS Providers:**  \n- **Cloudflare DNS:** `1.1.1.1` and `1.0.0.1` (secure & privacy-focused)  \n- **Google DNS:** `8.8.8.8` and `8.8.4.4` (fast & reliable)  \n- **OpenDNS:** `208.67.222.222` and `208.67.220.220` (extra security features)  \n- **Quad9:** `9.9.9.9` (blocks malicious domains)",
                "description": "Guide to changing system DNS",
                "messages": 44,
                "last_message": 0
            },
            "fp": {
                "response": "### **What is a False Positive in Antivirus Software?**\n\nA **false positive** occurs when antivirus or security software mistakenly identifies a legitimate, harmless file as malicious or infected with a virus. \n\nThis happens because:\n\n1. **Antivirus software** scans files for patterns, behaviors, or code sequences commonly associated with viruses or malware.\n2. Sometimes, **legitimate programs** or files may share characteristics (such as similar code or behavior) with known threats.\n3. As a result, the antivirus mistakenly flags these **safe files** as harmful.\n\n### Example:\n- **Legitimate file:** A new software update or a file from a trusted source.\n- **Antivirus action:** The software flags it as a virus.\n- **Reality:** The file is actually harmless, but the antivirus falsely identifies it as dangerous.\n\n### How to Handle False Positives:\n- **Update the antivirus**: Sometimes false positives are fixed with new virus definitions.\n- **Whitelist the file**: You can manually tell the a",
                "description": "Explanation of antivirus false positives",
                "messages": 44,
                "last_message": 0
            },
            "info": {
                "response": "Wanna know whether a game has **DLC** or not, or maybe looking for something else? Every game has a **\"Game Features\"** button at its page, click it, and there should be all the info you are looking for.",
                "description": "How to find game information",
                "messages": 44,
                "last_message": 0
            },
            "controller": {
                "description": "Joystick configuration guide",
                "response": "Whether you're using a PlayStation, Xbox, or any other compatible controller, this guide you through the simple steps to get your controller ready for gaming in no time : <https://www.makeuseof.com/how-to-set-up-use-console-controllers-steam/>\n\nOr, try that :\nFix all steam controller issues lol:\n\nright click space war in steam. go to controller. click the GRAY UNDERLINED LINK that says Controller Configurator. Click disable steam input at the top right. this will control all OFME games that run off steam. This also works for other games you're having trouble with. Only use steam input if a game doesn't work with steam input disabled. You can attempt to set this globally but I've had mixed results. Some non steam games even have issues with controls if steam is open. I wish they would make steam input disabled by default."
            },
            "redist": {
                "response": "<https://www.techpowerup.com/download/visual-c-redistributable-runtime-package-all-in-one/>\n1. Click on the link above, then click on ‘Download’.\n2. Click on any flag to start the download\n3. Extract the archive: right-click -> **\"Extract all “**, then press **”Extract ’**.\n4. The extracted folder opens: right-click on **\"install_all “** -> **”Run as administrator ’** to launch the installation\n5. Wait for it to finish, restart the PC, then test what wasn't working",
                "description": "How to install Visual C++ Redistributables",
                "messages": 44,
                "last_message": 0
            },
            "sm2": {
                "response": "https://discord.com/channels/1289627804211609640/1309841345904381952/1340074667935010907",
                "description": "YES IT WORKING"
            },
            "ud": {
                "response": "This little program will carry out a diagnosis of your PC to identify what is wrong with it:\n1. Download the application: <https://userdiag.com/>\n2. Close as many open applications as possible\n3. Launch the application and then the **__Quick Diagnostic__**.\n4. **When the test is complete, __send the link to this room__ (CTRL + V)**.",
                "description": "Show specs and potential problem in your'e pc"
            },
            "mods": {
                "response": "**Notice:** We do not offer support for game mods. If you require assistance with a mod, please contact the support team for the specific mod in question. Thank you for your understanding.",
                "description": "**Notice:** We do not offer support for game mods. If you require assistance with a mod, please contact the support team for the specific mod in question. Thank you for your understanding."
            },
            "ini": {
                "response": "# Changing Game Language via .ini File\n\n**Follow these steps to change the language of your game:**\n\n1. **Locate the Game Directory**:\n    - Find the folder where your game is installed. \n\n2. **Find the .ini File**:\n    - Look for a file with a `.ini` extension. This file usually contains the game's settings and configurations. It might be named something like `SteamConfig.ini` or `steam_api.ini` or `OnlineFix.ini`. or everything with a .ini\n\n3. **Open the .ini File**:\n    - Right-click on the `.ini` file and select `Open with` → `Notepad` or any other text editor you prefer.\n\n4. **Find the Language Setting**:\n    - Search within the file for a line that specifies the language setting. It might look something like this:\n```Language=English```\n\n\n5. **Change the Language Setting**:\n    - Replace the current language with your desired language. For example, to change the language to Spanish, modify the line to:\n      ```Language=Spanish```\n\n6. **Save the Changes**:\n    - Save the file by pressing `Ctrl + S` or going to `File` → `Save`.\n\n7. **Restart the Game**:\n    - Close and reopen the game for the changes to take effect.\n\n**Note:** Make sure to back up the original `.ini` file before making any changes, in case you need to revert to the default settings.",
                "description": "How to edit .ini (basically for edit language, for example)"
            },
            "zip": {
                "response": "To download and use 7-Zip, follow these steps:\n\n1. **Download 7-Zip**:\n   - Visit the official [7-Zip website](https://www.7-zip.org/).\n   - Choose the version compatible with your operating system (e.g., 32-bit or 64-bit).\n   - Click on the download link to save the installer.\n\n2. **Install 7-Zip**:\n   - Locate the downloaded file and double-click it to start the installation.\n   - Follow the on-screen instructions, selecting the default options unless you have specific preferences.\n   - Once installed, you can find 7-Zip in your Start menu or desktop.\n\n3. **Extract a Folder**:\n   - Right-click on the compressed file you want to extract.\n   - Hover over the \"7-Zip\" option in the context menu.\n   - Select \"Extract Here\" to extract the contents to the current folder, or \"Extract to [Folder Name]\" to create a new folder for the extracted files.",
                "description": "How to extract with 7zip"
            },
            "save": {
                "response": "# 1. Where is my save :c ?\n\n- **C:\\Users%username%\\AppData\\Roaming\\HOODLUM:** This folder may contain specific data related to the HOODLUM application, such as configuration files or user settings.\n- **C:\\Users\\Public\\Documents\\onlinefix\\appid:** This path is likely used for storing documents related to online fixes for applications identified by their appid (application identifier).\n- **C:\\Users%username%\\Documents:** This folder is where users typically store personal documents such as text files, spreadsheets, presentations, and more.\n- **C:\\Users%username%\\AppData\\Local:** This folder contains application data specific to the local user profile. It's often used to store settings and temporary files for applications.\n- **C:\\Users%username%\\AppData\\Roaming\\EMPRESS:** This folder may contain specific data related to the EMPRESS application, such as configuration files or user settings.\n- **C:\\Users%username%\\AppData\\Roaming\\Goldberg UplayEmu Saves:** This folder probably contains saved game data for games using the Goldberg Uplay emulator.\n- **C:\\Users%username%\\Saved Games:** This folder contains saved game data for various games, allowing players to continue their progress from where they left off.\n- **C:\\Users%username%\\AppData\\Roaming:** This folder stores application data that should roam with the user profile across different devices. It includes settings and data that are meant to be consistent across multiple machines.\n- **C:\\Users%username%\\AppData\\Roaming\\Goldberg Social Club Emu Saves:** This folder likely holds saved game data for games that use the Goldberg Social Club emulator.",
                "description": "How to find game saves"
            },
            "base64": {
                "response": "**Step 1: Find a Reliable Base64 Decoding Website**\nThere are several websites that offer Base64 decoding tools. Like [base64.io](https://base64.io/)\n\n**Step 2: Copy the Base64 Encoded Link**\nCopy the Base64 encoded link that you want to decode. It usually looks like a long string of characters, for example, `aHR0cHM6Ly93d3cuZXhhbXBsZS5jb20=`.\n\n**Step 3: Paste the Encoded Link into the Decoding Tool**\nGo to one of the Base64 decoding websites mentioned above. You will see a text box where you can paste the Base64 encoded link.\n\n**Step 4: View the Decoded Link**\nThe decoded link will be displayed in a text box. It will reveal the original URL or text that was encoded. For example, the decoded link for `aHR0cHM6Ly93d3cuZXhhbXBsZS5jb20=` would be `https://www.example.com`.\n\n**Final Note:**\nAlways be cautious when decoding links or text, especially if you are not sure about the source. Decoding unknown links can potentially lead to malicious websites or content.",
                "description": "How to decrypt base64 link"
            },
            "speed": {
                "response": "We have no control over the Download Speed. Use a Download Manager if you dont already, but otherwise theres nothing we can do",
                "description": "Pls bro stop asking about download speed im losing my mind"
            },
            "question": {
                "response": "## How to ask a question in [AnkerGames ?](<https://discord.gg/S6wJVyUNbd>)\n1. Unless it's related to the <#1299637310375198760> ask directly without permission ([explications](<https://dontasktoask.com/en/>)) \n* Describe the problem, not how you feel,\n* Do not ask for an expert, someone who has already had the problem or mention someone, otherwise others who have the answer will say nothing,\n* Don't ask how to apply a solution to a problem, just describe the problem in detail. ([explications](<https://xyproblem-info.translate.goog/?_x_tr_sl=en&_x_tr_tl=fr>)),\n* Make an effort on the problem: fairly short, a single message (use shift + enter if necessary), a photo or screen if useful, politeness,\n* Do not copy the same request to several lounges,\n* Check that the question is in the right room and that you have access (top left in <id:customize>),\n* Avoid asking a question whose answer is easy to find in a Google search,\n* Check that the question complies with the <#1299637310375198760> .",
                "description": "How to ask a question"
            },
            "mobile": {
                "response": "We do not provide support for mobile phones regarding PC games. You are free to try playing, but please note that we cannot assist or guarantee functionality. Thank you for your understanding.",
                "description": "We dont provide help for mobile"
            },
            "fdm": {
                "description": "How to use FDM for better speed",
                "response": "https://rentry.co/freedownloadmanager"
            },
            "jd2": {
                "description": "How to use JD2 for better performance",
                "response": "https://rentry.co/jd0wnloader2"
            },
            "safe": {
                "description": "OMG IS THAT WEBSITE SAFE ????",
                "response": "Oh, you wanna know if AnkerGames is safe? Wow. What a brave question. A question so bold, it echoes through the halls of cyberspace like a lost Reddit post with zero upvotes. I mean, the suspense! The thrill! You typing that out must’ve felt like hacking into the Matrix. “Is... AnkerGames... safe?” Cue dramatic music. Somewhere, a keyboard warrior drops his Mountain Dew in awe.\n\nLet me guess, you saw a game for $4.99 that’s $60 on Steam, your palms got sweaty, knees weak, mom’s spaghetti, and you thought: “This is either a gift from God or the devil’s coupon.” And now you're here, frantically googling while whispering “Please don’t steal my credit card, mysterious game site.”\n\nWell, look. I did the digital version of poking it with a stick. I crawled through the pixelated trenches, dodged sketchy popups, and metaphorically licked the website’s code like a curious toddler. And guess what? It’s safe. I mean, not “kiss it on the mouth” safe, but like “buy your game and move on with your\nyour life” safe. They’re legit.\n \nSo breathe easy, warrior. Your PC won’t explode, your wallet won’t get hacked, and your grandmother’s Facebook won’t start selling Ray-Bans. AnkerGames is fine. Now go get your discount and stop acting like you're defusing a bomb every time you shop online."
            },
            "lnf": {
                "description": "How to open a game with this error :cccc",
                "response": "### **How to Handle the Infamous “You Don’t Have License” Error on Steam**\n\nAh, the joy of launching your freshly installed game on Steam, only to be greeted by the charming error message: *“You don’t have license.”* Fear not, for you’re not alone in this cosmic struggle—this error is practically the hallmark of overlooked .exe files.\n\n### **Step 1: Enter Panic Mode**\nUpon seeing this error, the first logical reaction is, of course, sheer panic. Start googling obscure troubleshooting forums, uninstall and reinstall the game six times, maybe even contact Steam support if you're feeling ambitious.\n\n### **Step 2: Ignore the Real Solution**\nNaturally, the solution to this issue is hidden in plain sight. It’s not in the settings menu, nor is it in the depths of your game files. The true hero of this saga lies quietly on the official AnkerGames website, waiting to save the day in the “Game Features” or *gasp* the “How to Play” section. But who reads those anyway?\n### **Step 3: Locate the Sacred .exe**\nOnce your extensive troubleshooting efforts inevitably fail, proceed to the AnkerGames website. There, you'll find the **correct .exe** file name mentioned in clear, unmistakable text. Yes, the file you need to launch the game successfully is noted right there, because simplicity is underrated.\n\n### **Step 4: Experience a Mix of Shame and Relief**\nDouble-click on the right .exe file and—voilà!—your game launches effortlessly. Revel in the satisfaction of solving the error, while simultaneously kicking yourself for not checking the website earlier."
            }
        }
    },
    "global": {
        "tryit": {
            "description": "Sometimes, try before ask, should help a lot :)",
            "response": "https://tryitands.ee/"
        }
    }
}